{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from rdflib import Namespace, Graph\n",
    "from rdflib.namespace import RDF, RDFS, XSD, FOAF\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "sparql = SPARQLWrapper(\"http://localhost:3030/lobbyradar/sparql\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "sparql.setReturnFormat(JSON)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "prefixes = \"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX lobbyOntology: <https://studi.f4.htw-berlin.de/~s0539710/lobbyradar/ontology#>\n",
    "PREFIX lobbyFacts: <https://studi.f4.htw-berlin.de/~s0539710/lobbyradar#>\n",
    "PREFIX org: <http://www.w3.org/ns/org#>\n",
    "PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Get 10 lobby organizations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Lobbyorganisation: Bundesverband freier Berufsbetreuer e.V.\n",
      "Lobbyorganisation: DAV - Deutsche Aktuarvereinigung e.V.\n",
      "Lobbyorganisation: Deutscher Schwerhörigenbund e.V. DSB\n",
      "Lobbyorganisation: Deutsche Gesellschaft für Recht und Informatik (DGRI) e.V.\n",
      "Lobbyorganisation: Gesellschaft für Wehr- und Sicherheitspolitik e.V.\n",
      "Lobbyorganisation: Stiftung 2° - Deutsche Unternehmer für Klimaschutz\n",
      "Lobbyorganisation: Deutsche Gesellschaft für Ur- und Frühgeschichte (DGUF) e.V.\n",
      "Lobbyorganisation: Deutsche Gesellschaft zur Förderung der Unterwasserarchäologie e.V.\n",
      "Lobbyorganisation: Wissensforum Backwaren e.V. (WFB)\n",
      "Lobbyorganisation: Deutsche Stiftung Mediation\n"
     ]
    }
   ],
   "source": [
    "sparql.setQuery(prefixes + \n",
    "\"\"\"\n",
    "SELECT ?name WHERE {\n",
    "    ?org rdf:type lobbyOntology:LobbyOrganization ;\n",
    "        foaf:name ?name\n",
    "} LIMIT 10\n",
    "\"\"\")\n",
    "\n",
    "result = sparql.query().convert()\n",
    "for row in result['results']['bindings']:\n",
    "    print(\"Lobbyorganisation: %s\" % row['name']['value'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Get all organizations that work with arms and weaponry"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Organizations in the arms field:\n",
      " - THALES Defence Deutschland GmbH\n",
      " - Diehl Aerospace\n",
      " - SIG SAUER GmbH & Co. KG\n",
      " - Heckler & Koch GmbH\n",
      " - Freundeskreis Fregatte Baden-Württemberg e.V.\n",
      " - European Security and Defense Association\n",
      " - Forum Luft- und Raumfahrt e.V.\n",
      " - Verteidigungsausschuss\n",
      " - Carl Walther GmbH\n",
      " - Interessengemeinschaft Deutsche Luftwaffe e.V.\n",
      " - MBDA Missle Systems\n",
      " - Krauss-Maffai Wegmann GmbH & Co. KG\n",
      " - Bundeswehr\n",
      " - Bundesministerium der Verteidigung\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?name WHERE {\n",
    "    ?org rdf:type lobbyOntology:ArmsCorporation ;\n",
    "        foaf:name ?name\n",
    "}  \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "\n",
    "print(\"Organizations in the arms field:\")\n",
    "result = sparql.query().convert()\n",
    "for row in result['results']['bindings']:\n",
    "    print ' - %s' % row['name']['value']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Get all members of a lobby organization"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Members of BLL:\n",
      " - Ferrero Deutschland GmbH\n",
      " - Schwartauer Werke GmbH & Co\n",
      " - QS Qualität und Sicherheit GmbH\n",
      " - Mondelez\n",
      " - Nordzucker AG\n",
      " - Verband der Hersteller kulinarischer Lebensmittel e.V.\n",
      " - Südzucker AG\n",
      " - Coca-Cola\n",
      " - Nestlé\n",
      " - Tengelmann Warenhandelsgesellschaft KG\n",
      " - Bahlsen GmbH & Co. KG\n",
      " - Philip Morris GmbH\n",
      " - METRO AG\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?member_name WHERE {\n",
    "    ?org rdf:type lobbyOntology:LobbyOrganization ;\n",
    "        foaf:name \"Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\" .\n",
    "    ?member org:memberOf ?org ;\n",
    "        foaf:name ?member_name .\n",
    "} \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "\n",
    "print(\"Members of BLL:\")\n",
    "result = sparql.query().convert()\n",
    "for row in result['results']['bindings']:\n",
    "    print \" - %s\" % row['member_name']['value']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Get all work addresses of members of organizations in the arms field"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Organizations in the arms field:\n",
      "{u'street': {u'type': u'literal', u'value': u''}}\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?street WHERE {\n",
    "    ?org rdf:type lobbyOntology:ArmsCorporation ;\n",
    "        foaf:name ?name .\n",
    "    ?e org:memberOf ?org ;\n",
    "        vcard:hasAddress ?address .\n",
    "    ?address vcard:street-address ?street  .\n",
    "}  \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "result = sparql.query().convert()\n",
    "\n",
    "print(\"Organizations in the arms field:\")\n",
    "for row in result['results']['bindings']:\n",
    "    print row\n",
    "#    print ' - %s' % row['address']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "```DESCRIBE ?address WHERE {\n",
    "    ?org rdf:type lobbyOntology:ArmsCorporation ;\n",
    "        foaf:name ?name .\n",
    "    ?e org:memberOf ?org ;\n",
    "        vcard:hasAddress ?address .\n",
    "}```\n",
    "\n",
    "out:\n",
    "```\n",
    "[ a                   vcard:Work ;\n",
    "  rdfs:label          \"Geschäftsstelle, Hochstadenring 50\" ;\n",
    "  vcard:country-name  \"Deutschland\" ;\n",
    "  vcard:hasEmail      \"info@dwt-sgw.de\" ;\n",
    "  vcard:hasFN         \"Deutsche Gesellschaft für Wehrtechnik e.V. ( DWT)\" ;\n",
    "  vcard:hasTelephone  \"+49228410980\" ;\n",
    "  vcard:locality      \"Bonn\" ;\n",
    "  vcard:postal-code   \"53119\"\n",
    "] .\n",
    "\n",
    "[ a                     vcard:Work ;\n",
    "  rdfs:label            \"\" ;\n",
    "  vcard:country-name    \"\" ;\n",
    "  vcard:hasFN           \"Deutsche Gesellschaft für Wehrtechnik e.V.\" ;\n",
    "  vcard:locality        \"Bonn\" ;\n",
    "  vcard:postal-code     \"\" ;\n",
    "  vcard:street-address  \"\"\n",
    "] .\n",
    "\n",
    "[ a                   vcard:Work ;\n",
    "  rdfs:label          \"Luisenstraße 41\" ;\n",
    "  vcard:country-name  \"Deutschland\" ;\n",
    "  vcard:hasEmail      \"frank.kleinkauf@dwt-sgw.de\" ;\n",
    "  vcard:hasFN         \"Dipl.-Ing. Frank Kleinkauf\" ;\n",
    "  vcard:hasTelephone  \"+4930240477715\" ;\n",
    "  vcard:locality      \"Berlin\" ;\n",
    "  vcard:postal-code   \"10117\"\n",
    "] .\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Get all parties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Political Parties:\n",
      " - FW\n",
      " - Pro D\n",
      " - Pro NRW\n",
      " - ÖDP\n",
      " - AfD\n",
      " - CSU\n",
      " - MLPD\n",
      " - Grüne\n",
      " - SPD\n",
      " - CDU Landesverband Sachsen\n",
      " - Die Partei\n",
      " - SSW\n",
      " - CDU\n",
      " - Bündnis 90/Die Grünen Hessen\n",
      " - ÖVP\n",
      " - FDP\n",
      " - NPD\n",
      " - Die Linke\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?party_name WHERE {\n",
    "    ?org rdf:type lobbyOntology:PoliticalParty ;\n",
    "        foaf:name ?party_name .\n",
    "}  \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "result = sparql.query().convert()\n",
    "\n",
    "print(\"Political Parties:\")\n",
    "for row in result['results']['bindings']:\n",
    "    print ' - %s' % row['party_name']['value']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Select names of entities that donated to the party AfD and amount of donation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Donations to AfD:\n",
      "Christian Duus donated 10500.0 to AfD\n",
      "Wahl-Bau GmbH donated 50000.0 to AfD\n",
      "Erika Edler donated 50000.0 to AfD\n",
      "Gregor Scheipers donated 15383.18 to AfD\n",
      "Hellmut Fölster donated 13687.85 to AfD\n",
      "Ulrich Wlecke donated 14500.0 to AfD\n",
      "Dr. Uwe Kaack donated 11250.0 to AfD\n",
      "Prof. Dr. Roland Vaubel donated 28203.0 to AfD\n",
      "Dr. Folkard Edler donated 50000.0 to AfD\n",
      "Horst Lieberwirth donated 11750.0 to AfD\n",
      "Gottfried Heller donated 12000.0 to AfD\n",
      "Johannes Ross donated 17389.49 to AfD\n",
      "Günter Reimer donated 13400.0 to AfD\n",
      "Dr. Winfried Schuhmann donated 22345.22 to AfD\n",
      "Dr. Carsten Albers donated 13000.0 to AfD\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?name ?amount WHERE {\n",
    "    ?someone lobbyOntology:donated ?donation .\n",
    "    lobbyFacts:AfD lobbyOntology:received ?donation .\n",
    "    ?someone foaf:name ?name .\n",
    "    ?donation lobbyOntology:amount ?amount .\n",
    "}  \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "result = sparql.query().convert()\n",
    "\n",
    "print(\"Donations to AfD:\")\n",
    "for row in result['results']['bindings']:\n",
    "    print \"%s donated %s to AfD\" %  (row['name']['value'], row['amount']['value']) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Find anyone who donated to the party FDP and any organization they are a member of"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Political Parties:\n",
      "Philip Morris GmbH donated 10500.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 23008.05 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Südzucker AG donated 23008.05 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Südzucker AG donated 23008.05 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 23008.05 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "Rainer Brüderle donated 14000.0 to FDP and is member of Kabinett Merkel II\n",
      "Rainer Brüderle donated 14000.0 to FDP and is member of Bundessicherheitsrat\n",
      "Sabine Leutheusser-Schnarrenberger donated 11684.0 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 11684.0 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 11684.0 to FDP and is member of Deutscher Kinderschutzbund e.V.\n",
      "Robert Bosch GmbH donated 42000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Robert Bosch GmbH donated 71580.6 to FDP and is member of Robert Bosch Stiftung\n",
      "Carl-Ludwig Thiele donated 13109.48 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Deutsche Bank donated 220000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 220000.0 to FDP and is member of Hering Schuppener\n",
      "Deutsche Bank donated 33233.85 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 33233.85 to FDP and is member of Hering Schuppener\n",
      "Patrick Meinhardt donated 12664.7 to FDP and is member of FDP\n",
      "Rheinmetall AG donated 14000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Rheinmetall AG donated 14000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Rheinmetall AG donated 14000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Sabine Leutheusser-Schnarrenberger donated 11886.19 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 11886.19 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 11886.19 to FDP and is member of Deutscher Kinderschutzbund e.V.\n",
      "Deutsche Bank donated 76693.5 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 76693.5 to FDP and is member of Hering Schuppener\n",
      "Commerzbank donated 75000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Commerzbank donated 75000.0 to FDP and is member of American Chamber of Commerce in Germany e.V.\n",
      "Commerzbank donated 25564.5 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Commerzbank donated 25564.5 to FDP and is member of American Chamber of Commerce in Germany e.V.\n",
      "Carl-Ludwig Thiele donated 11853.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Guido Westerwelle donated 11720.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 11720.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 11720.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Guido Westerwelle donated 11570.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 11570.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 11570.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Airbus Group donated 30000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Airbus Group donated 30000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Airbus Group donated 30000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Otto Graf Lambsdorff donated 13804.83 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Guido Westerwelle donated 10120.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 10120.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 10120.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Deutsche Bank donated 66467.7 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 66467.7 to FDP and is member of Hering Schuppener\n",
      "Robert Bosch GmbH donated 17895.15 to FDP and is member of Robert Bosch Stiftung\n",
      "Deutsche Bank donated 200250.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 200250.0 to FDP and is member of Hering Schuppener\n",
      "Deutsche Bank donated 77286.6 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 77286.6 to FDP and is member of Hering Schuppener\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "Guido Westerwelle donated 12547.8 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 12547.8 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 12547.8 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Robert Bosch GmbH donated 100000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Südzucker AG donated 24000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Südzucker AG donated 24000.0 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Südzucker AG donated 24000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 24000.0 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "Carl-Ludwig Thiele donated 12614.97 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Deutsche Bank donated 220000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 220000.0 to FDP and is member of Hering Schuppener\n",
      "Bionorica SE donated 19800.0 to FDP and is member of Bundesverband der Arzneimittel-Hersteller e.V.\n",
      "Verband Forschender Arzneimittelhersteller donated 12782.25 to FDP and is member of Pfizer Deutschland GmbH\n",
      "Cornelia Pieper donated 11340.18 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 12620.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 12620.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 12620.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Guido Westerwelle donated 10920.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 10920.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 10920.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Deutsche Bank donated 200000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 200000.0 to FDP and is member of Hering Schuppener\n",
      "Sabine Leutheusser-Schnarrenberger donated 17125.22 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 17125.22 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 17125.22 to FDP and is member of Deutscher Kinderschutzbund e.V.\n",
      "Philip Morris GmbH donated 10225.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Rheinmetall AG donated 17000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Rheinmetall AG donated 17000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Rheinmetall AG donated 17000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Solarworld AG donated 35000.0 to FDP and is member of Bundesverband Solarwirtschaft e.V.\n",
      "Commerzbank donated 50000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Commerzbank donated 50000.0 to FDP and is member of American Chamber of Commerce in Germany e.V.\n",
      "E.ON donated 50000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Iveco Magirus AG donated 15338.7 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Iveco Magirus AG donated 15338.7 to FDP and is member of Verband der Automobilindustrie\n",
      "Helm AG donated 15000.0 to FDP and is member of Bundesverband der Arzneimittel-Hersteller e.V.\n",
      "Philip Morris GmbH donated 25000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Deutsche Bank donated 100000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 100000.0 to FDP and is member of Hering Schuppener\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 38000.0 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "Philip Morris GmbH donated 12225.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Rheinmetall AG donated 15000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Rheinmetall AG donated 15000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Rheinmetall AG donated 15000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Wolfgang Gerhardt donated 11942.2 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Robert Bosch GmbH donated 40000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Commerzbank donated 60000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Commerzbank donated 60000.0 to FDP and is member of American Chamber of Commerce in Germany e.V.\n",
      "Robert Bosch GmbH donated 50000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Jimmy Schulz donated 11795.0 to FDP and is member of Enquete-Kommission Internet und digitale Gesellschaft\n",
      "Robert Bosch GmbH donated 25000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Südzucker AG donated 15000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Südzucker AG donated 15000.0 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Südzucker AG donated 15000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 15000.0 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "Sabine Leutheusser-Schnarrenberger donated 10104.0 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 10104.0 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 10104.0 to FDP and is member of Deutscher Kinderschutzbund e.V.\n",
      "CNC - Communications & Network Consulting AG donated 48000.0 to FDP and is member of Philip Morris GmbH\n",
      "Robert Bosch GmbH donated 15338.7 to FDP and is member of Robert Bosch Stiftung\n",
      "Philip Morris GmbH donated 20225.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Jimmy Schulz donated 11120.01 to FDP and is member of Enquete-Kommission Internet und digitale Gesellschaft\n",
      "Robert Bosch GmbH donated 51129.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Südzucker AG donated 15338.7 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Südzucker AG donated 15338.7 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Südzucker AG donated 15338.7 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Südzucker AG donated 15338.7 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "HanseMerkur-Versicherungsgruppe donated 25000.0 to FDP and is member of HanseMerkur Krankenversicherung AG\n",
      "Philip Morris GmbH donated 31000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "E.ON donated 50000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Carl-Ludwig Thiele donated 10043.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Guido Westerwelle donated 11370.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 11370.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 11370.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Eric Schweitzer donated 32500.0 to FDP and is member of TTIP-Beirat des BMWi\n",
      "Sabine Leutheusser-Schnarrenberger donated 10049.84 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 10049.84 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 10049.84 to FDP and is member of Deutscher Kinderschutzbund e.V.\n",
      "Porsche Automobil Holding SE donated 80000.0 to FDP and is member of Verband der Automobilindustrie\n",
      "Nordzucker AG donated 13500.0 to FDP and is member of Bundesvereinigung der Deutschen Ernährungsindustrie e.V. (BVE)\n",
      "Nordzucker AG donated 13500.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Nordzucker AG donated 13500.0 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Philip Morris GmbH donated 12000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Robert Bosch GmbH donated 40000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Sabine Leutheusser-Schnarrenberger donated 24202.98 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 24202.98 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 24202.98 to FDP and is member of Deutscher Kinderschutzbund e.V.\n",
      "Philip Morris GmbH donated 12000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Commerzbank donated 41250.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Commerzbank donated 41250.0 to FDP and is member of American Chamber of Commerce in Germany e.V.\n",
      "Guido Westerwelle donated 21020.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 21020.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 21020.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Deutsche Bank donated 50000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 50000.0 to FDP and is member of Hering Schuppener\n",
      "Jan Mücke donated 12191.0 to FDP and is member of FDP\n",
      "E.ON donated 50000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Ulrike Flach donated 11817.96 to FDP and is member of Kabinett Merkel II\n",
      "Wolfgang Gerhardt donated 13885.48 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Philip Morris GmbH donated 15225.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Philip Morris GmbH donated 13549.18 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Otto Graf Lambsdorff donated 11606.28 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Guido Westerwelle donated 11120.56 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 11120.56 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 11120.56 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Werner Hoyer donated 10370.0 to FDP and is member of Kabinett Merkel II\n",
      "Wolfgang Gerhardt donated 10492.91 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Airbus Group donated 30000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Airbus Group donated 30000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Airbus Group donated 30000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Bahlsen GmbH & Co. KG donated 12000.0 to FDP and is member of Bund für Lebensmittelrecht und Lebensmittelkunde e.V. (BLL)\n",
      "Bahlsen GmbH & Co. KG donated 12000.0 to FDP and is member of Bundesverband der Deutschen Süßwarenindustrie e.V. (BDSI)\n",
      "Deutsche Bank donated 66467.7 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 66467.7 to FDP and is member of Hering Schuppener\n",
      "Ruth Wagner donated 10217.6 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Deutsche Bank donated 51129.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 51129.0 to FDP and is member of Hering Schuppener\n",
      "Rheinmetall AG donated 15000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Rheinmetall AG donated 15000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Rheinmetall AG donated 15000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Ulrike Flach donated 11379.78 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 10050.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 10050.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 10050.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Porsche Automobil Holding SE donated 19000.0 to FDP and is member of Verband der Automobilindustrie\n",
      "Commerzbank donated 50650.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Commerzbank donated 50650.0 to FDP and is member of American Chamber of Commerce in Germany e.V.\n",
      "Werner Hoyer donated 11499.1 to FDP and is member of Kabinett Merkel II\n",
      "Kirchhoff-Gruppe donated 13300.0 to FDP and is member of KIRCHHOFF Holding GmbH & Co. KG\n",
      "Rheinmetall AG donated 11000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Rheinmetall AG donated 11000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Rheinmetall AG donated 11000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Guido Westerwelle donated 10562.0 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 10562.0 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 10562.0 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Robert Bosch GmbH donated 25000.0 to FDP and is member of Robert Bosch Stiftung\n",
      "Deutsche Bank donated 220000.0 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 220000.0 to FDP and is member of Hering Schuppener\n",
      "E.ON donated 50000.0 to FDP and is member of Verein der Kohlenimporteure e.V.\n",
      "Porsche Automobil Holding SE donated 50000.0 to FDP and is member of Verband der Automobilindustrie\n",
      "Rheinmetall AG donated 27000.0 to FDP and is member of Deutsche Gesellschaft für Wehrtechnik e.V.\n",
      "Rheinmetall AG donated 27000.0 to FDP and is member of Förderkreis Deutsches Heer e.V.\n",
      "Rheinmetall AG donated 27000.0 to FDP and is member of Bundesverband der Deutschen Sicherheits- und Verteidigungsindustrie\n",
      "Deutsche Bank donated 28138.85 to FDP and is member of Bundesverband Deutscher Banken\n",
      "Deutsche Bank donated 28138.85 to FDP and is member of Hering Schuppener\n",
      "Guido Westerwelle donated 12884.51 to FDP and is member of Kabinett Merkel II\n",
      "Guido Westerwelle donated 12884.51 to FDP and is member of Bundessicherheitsrat\n",
      "Guido Westerwelle donated 12884.51 to FDP and is member of Atlantik-Brücke e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 10413.52 to FDP and is member of Kabinett Merkel II\n",
      "Sabine Leutheusser-Schnarrenberger donated 10413.52 to FDP and is member of Gegen Vergessen - Für Demokratie e.V.\n",
      "Sabine Leutheusser-Schnarrenberger donated 10413.52 to FDP and is member of Deutscher Kinderschutzbund e.V.\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?name ?amount ?organization WHERE {\n",
    "    ?someone lobbyOntology:donated ?donation .\n",
    "    lobbyFacts:FDP lobbyOntology:received ?donation .\n",
    "    ?someone foaf:name ?name ;\n",
    "        org:memberOf ?org.\n",
    "    ?org foaf:name ?organization .\n",
    "    ?donation lobbyOntology:amount ?amount .\n",
    "}  \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "result = sparql.query().convert()\n",
    "\n",
    "print(\"Political Parties:\")\n",
    "for row in result['results']['bindings']:\n",
    "    print \"%s donated %s to FDP and is member of %s\" %  (row['name']['value'], row['amount']['value'], row['organization']['value']) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Select all corporations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Corporations:\n",
      "{u'name': {u'type': u'literal', u'value': u'Hanns-Joachim-Friedrich-Preis'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Norddeutscher Rundfunk'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Neues Deutschland Druckerei und Verlag GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Fifp e.v., F\\xf6rderverein des Ifp ( Institut zur F\\xf6rderung publizistischen Nachwuchses e.v.)'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ringier AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'netzwerk recherche'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Mitteldeutsche Medienf\\xf6rderung GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bertelsmann SE & Co. KGaA'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Lokalfunk Bonn/Rhein-Sieg e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Carl-Zuckmayer-Medaille'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'WDR'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Landesanstalt f\\xfcr Medien Nordrhein-Westfalen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gruner + Jahr'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'mdr'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'RTL Television GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Thomson Reuters'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Frankfurter Allgemeine Zeitung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Deutschlandradio'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hubert Burda Media Holding GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Presse- und Informationsamt der Bundesregierung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Axel-Springer-Verlag'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'International Press Institut'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'McGraw-Hill'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'PEN-Zentrum Deutschland'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Handelsblatt GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ausschuss f\\xfcr Kultur und Medien'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Neue Deutsche Medienmacher'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband der Zeitschriftenverleger'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Funke Mediengruppe'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Westdeutsche Allgemeine Zeitung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband Druck und Medien Bayern e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ZDF'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'S\\xfcdwestrundfunk'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'HandwerkMedia AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'WilmerHale'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Letzebuerger Journal'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium f\\xfcr Bauen, Wohnen, Stadtentwicklung und Verkehr Nordrhein-Westfalen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wohnungsbau Gr\\xf6negau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Axtmann Baubetreungs-AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hermann Peter KG Baustoffwerke'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'GBG-Mannheimer Wohnungsbaugesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesverband der Deutschen Zementindustrie e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Institut Privater Bauherren e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'C + W Bautr\\xe4gergesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kappel Bau Union AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesministerium f\\xfcr Verkehr, Bau und Stadtentwicklung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Baugesellschaft Vorw\\xe4rts Rud Aug Oetker KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Pollmeier Massivholz GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium f\\xfcr Wirtschaft, Bau und Tourismus Mecklenburg-Vorpommern'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Schweizerischer Ingenieur- und Architektenverein'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gemeinn\\xfctzige Wohnungsbaugenossenschaft eG (GWG)'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Beton & Rohbau C-F Thymian GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Rohrleitungs- und Anlagenbau KW GmbH,'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'SCHULTHEISS Wohnbau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wohnungsbaugenossenschaft \"Bremer H\\xf6he\" eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bauunternehmung Karl Gem\\xfcnden Gmbh & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'STRABAG Hoch- und Ingenieurbau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Interprojekt Wohnbauten GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Karst-Invest Erschlie\\xdfungs- und Bautr\\xe4ger GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'G & W Gewerbe- u Wohnungsbaugesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Br\\xfcckner-Maschinenbau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Klaus Hoch- und Tiefbau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stadtbau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gie\\xdfner Bauunternehmung GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Weisenburger Bau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Greulich & Co GmbH Bauunternehmen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'K&S Sozialbau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Portlandzementwerk Dotternhausen Rudolf Rohrbach KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Michels GmbH Sondermaschinenbau'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'WBG Wohnungsbaugesellschaft f\\xfcr das Rheinische Braunkohlenrevier GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'GRUND-IDEE Wohn- und Gewerbebau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wohnbau Mainz GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'JK Wohnbau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesinstitut f\\xfcr Bau-, Stadt- und Raumforschung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Johann Joos Tief- u Stra\\xdfenbauunternehmung GmbH & Co'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'S\\xfcdrohrbau GmbH & Co'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Werkmann Bautr\\xe4ger GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Delitzscher Bau Union GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stellv. Vorsitzender des Beirates f\\xfcr Verkehr, Bau und Stadtentwicklung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Handwerksbau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ausschuss f\\xfcr Umwelt, Naturschutz, Bau und Reaktorsicherheit'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'HGO-Haus- und Grundst\\xfccksverwaltungsgesellschaft der gemeinn\\xfctzigen Wohnungsbaugenossenschaft Oppenheim mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hornbach Baumarkt AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bayrisches Staatsministerium des Inneren, f\\xfcr Bau und Verkehr'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Radmer Bau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wohnungsbaugesellschaft Magdeburg mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wittfeld Baugesellschaft mbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Union Beton Niedersachsen GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Architekten und Ingenieure Gotha GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bernd Schirmer WACO Planen + Bauen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'WVW Wohnungsbau Wohnungsverwaltung Wei\\xdfenfels GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Rethwisch Betonwerk GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'GWG Gesellschaft f\\xfcr Wohnungs- und Gewerbebau Baden-W\\xfcrttemberg AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'DEMOS Wohnbaugesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'OKS Kiesabbau Schladen + Splitt GmbH & Co Kieswerk KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Johann Bunte Bauunternehmung GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesministeriums f\\xfcr Umwelt, Naturschutz, Bau und Reaktorsicherheit'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Krieger Bau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'PROJEKTA Ingenieurgesellschaft f\\xfcr Tiefbautechnik Auerbach mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Holz von Hier gemeinn\\xfctzige GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesstiftung Baukultur'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'RUMPF architekten + ingenieure GbR'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wocon Stadthaus K\\xf6ln Bauprojekt Entwicklung GmbH & Co KG,'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Neue Marler Baugesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Zeppelin Baumaschinen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Friedrich Wassermann Bauunternehmung f\\xfcr Hoch- & Tiefbauten GmbH & Co'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'S\\xfcdbayerische Portland-Zementwerk, Gebr Wiesb\\xf6ck & Co. GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Doetsch Bautr\\xe4ger GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Falkenhahn Baugesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Baywobau Dresden Baubetreuungs GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'INDUWO Baugesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'TRP Bau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'THALES Defence Deutschland GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Diehl Aerospace'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'SIG SAUER GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Heckler & Koch GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Freundeskreis Fregatte Baden-W\\xfcrttemberg e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'European Security and Defense Association'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Forum Luft- und Raumfahrt e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verteidigungsausschuss'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Carl Walther GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Interessengemeinschaft Deutsche Luftwaffe e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'MBDA Missle Systems'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Krauss-Maffai Wegmann GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundeswehr'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesministerium der Verteidigung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Harder Jota Grundst\\xfccksverwaltungs GmbH 8t Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stuttgarter Haus- und Grundbesitzerverein e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesanstalt f\\xfcr Immobilienaufgaben'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Neustrelitzer Wohnungsgesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Grotel\\xfcschen Immobilien GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gifhorner Grundst\\xfccks- und Erschlie\\xdfungsgesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Montan Grundst\\xfccksgesellschaft'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'RA-WE Grundst\\xfccksinvestitionsberatung GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wohnungsgesellschaft Hohenstein-Ernstthal mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Trombello K\\xf6lbel Immobilienconsulting GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Rabo Real Estate Group'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Dr. Mingramm GmbH Immobilien und Handel'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hansa-Haus Grundst Gesellschaft'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gro\\xdf und Partner Grundst\\xfccksentwicklungsgesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Maruhn Immobilien, GmbH Co BertinCampus KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'FOM Real Estate'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Grundst\\xfccksverwaltung G\\xf6ttingen mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'FAKT Immobilien AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wohnungsgenossenschaft \"Gl\\xfcckauf\" S\\xfcd Dresden e.G.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Pacelli Immobilien und Liegenschaftenverwaltung GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'NH-Immobilien GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'USD Immobillien GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband der bayerischen Grundbesitzer e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Accumulata Immobilien Development GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Indiabulls Real Estate'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband Norddeutscher Wohnungsunternehmen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Grundst\\xfccksgesellschaft, Prof Gerhard Bremmer \\xb1 Bernhard Lorenz \\xb1 Michael Frielinghaus \\xb1 Mark Bremmer'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Pollux Grundst\\xfccksgesellschaft mbH & Co Verwaltungs-KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Scheffel Grund GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'EPRA European Public Real Estate Association'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'THS Wohnen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Krieger Grundst\\xfcck GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Luma Hausverwaltung Jan-Marco Luczak'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'GEG Grundst\\xfccksentwicklungsgesellschaft, H H G\\xf6ttsch KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'WEGA Immobilien-Verwaltungsgesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Immobilien-Braun Service GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Schotte & Partner Immobilien GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'mfi Management f\\xfcr Immobilien AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesverband Freier Immobilien- und Wohnungsunternehmen e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bedburger Kleinwohnungs-Genossenschaft eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'allod Immobilien- und Verm\\xf6gensverwaltungsgesellschaft mbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Soci\\xe9t\\xe9 Nationale Immobili\\xe8re'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'D\\xfcsseldorfer Wohnungsgenossenschaft e.G.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Institut der deutschen Immobilienwirtschaft e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'St\\xe4dtische Wohnungsgesellschaft D\\xfcsseldorf AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'CARAT Grundst\\xfccksentwicklungs-, gesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Perella Weinberg Real Estate'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Clair Immobilien Deutschland GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'B&B Hausverwaltung GbR'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'IVG Immobilien AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Modernes Wohnen Koblenz eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ImmobilienScout24'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Grundst\\xfccks- und Gewerbeentwicklung Kierspe GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Robert Zapp Grundst\\xfccksverwaltung GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bangkok Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkassen Versicherung Holding AG Sachsen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Allgemeine Hypothekenbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'BHW Bausparkasse AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Societe Generale'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Dieburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ulmer Volksbank eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bank I.Safra Sarasin Ltd.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Duisburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bayrisches Staatsministerium der Finanzen, f\\xfcr Landesentwicklung und Heimat'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gothaer-Versicherungs-Bank VVAG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Grafschaft Diepholz'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hessisches Ministerium der Finanzen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Forum Kapitalmarktinstrumente - Kapitalmarktfinanzierung e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ING-DiBa'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Hannover'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'TeamBank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Stendal'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Bitburg-Pr\\xfcm'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Raiffeisenbank International'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Burgenlandkreis'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium der Finanzen Rheinland-Pfalz'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'IMA Investment Management Association'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'CTBC Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Westdeutsche Landesbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Volksbank Mittweida eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Deutsche B\\xf6rse Group'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Vereins- und Westbank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'VPV Versicherungen VVaG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'F\\xf6rde Sparkasse'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stiftung Ostfriesische Volksbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'NIBC Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'NAREIT National Association of Real Estate Investment Trusts'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Commerzbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'DZ Bank, Deutsche Zentral-Genossenschaftsbank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'K\\xf6lner Bank eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Reutlingen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Versicherungsombudsmann e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkassenzweckverband Nassau'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Bamberg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bayerische Handelsbank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Schwalm-Eder'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkassenzweckverband Oldenburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Mayen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Banco Santander'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'S\\xe4chsisches Staatsministerium der Finanzen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'NordFinanz Bank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Deutsche Bundesbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'PAX-Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Raiffeisenbank Lauenburg e.G.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Melle'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'W\\xfcstenrot Bausparkasse AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bank Deutsches Kraftfahrzeuggewerbe'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Zweckverband Sparkasse Mainz'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Lloyds Banking Group'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Aareal Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband der Sparda-Banken'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ostdeutscher Sparkassenverband'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Landeskreditbank Baden-W\\xfcrttemberg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Investmentbank Rothschild'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Schwarzwald-Baar'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Anhalt-Bitterfeld'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Finanzministerium Brandenburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Trier'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Dinslaken-Voerde-H\\xfcnxe'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Europ\\xe4ische Bank f\\xfcr Wiederaufbau und Entwicklung'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'HBM Healthcare Investments AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium der Finanzen Sachsen-Anhalt'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bayerische Hypotheken- und Vereinsbank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Landesbank Berlin AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Expertenkommission zur St\\xe4rkung von Investitionen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Stade-Altes Land'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesanstalt f\\xfcr Finanzdienstleistungsaufsicht'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'KBC Bank NV'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Finanzministerium Mecklenburg-Vorpommern'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'UniCredit Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkassenverband Bayern'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'HSH Nordbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesministerium der Finanzen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparda-Bank M\\xfcnster eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'IIGCC Institutional Investors Group on Climate Change'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Landwirtschaftliche Rentenbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Osnabr\\xfcck'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'First State Investments'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hypothekenbank Essen AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Vest'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hauck & Aufh\\xe4user Privatbankiers KGaA'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparda-Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'VB-Bank Aalen eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bafin Bundesfinanzagentur'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Union Investment'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Deggendorf'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkassenzweckverband im Kreis Herford'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Provinzial Versicherungen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ABP Investments'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stadtsparkasse Augsburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Mercedes-Benz Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Orion Investment'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Essen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stiftung PSD L(i)ebenswert der PSD-Bank RheinNeckarSaar eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'STINAG Stuttgart Invest AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Grafschafter Volksbank eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkassenakademie Niedersachsen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'JP Morgan Chase'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'M\\xfcnchener Hypothekenbank eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Neuwied'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Nord/LB'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Stadtsparkasse D\\xfcsseldorf'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse G\\xf6ppingen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Afrikanische Entwicklungsbank (AfDB) und Afrikanische Entwicklungsfonds (AfDF)'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Lehman Brothers'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesverband Deutscher Banken'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Privatbankiers Delbr\\xfcck & Co'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Danske Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'S\\xe4chsische Aufbaubank - F\\xf6rderbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'EBRD European Bank for Reconstruction and Development'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium der Finanzen Nordrhein-Westfalen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Ostalb'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Finanzministerium Schleswig-Holstein'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Citigroup'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Mecklenburg-Strelitz'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'BGP Investment'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Rh\\xf6n-Rennsteig-Sparkasse'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bausparkasse Schw\\xe4bisch Hall'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Nieders\\xe4chsisches Finanzministerium'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Deutsche Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ADLER Versicherung AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'DAB Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Berenberg Bank Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sal Oppenheim jr & Cie. KGaA'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Zweckverband Sparkasse im Landkreis Schwandorf'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Oldenburgische Landesbank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Westm\\xfcnsterland'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse K\\xf6ln'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreditanstalt f\\xfcr Wiederaufbau'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium f\\xfcr Finanzen und Europa Saarland'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Institut Finanzen und Steuern e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ehrbare Versicherungskaufleute e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Merck Finck & Co oHG Privatbankiers'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'BCCI - Bank of Credit and Commerce International'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Europ\\xe4ische Zentralbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Bad D\\xfcrkheim'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'China CITIC Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium der Finanzen Th\\xfcringen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Dresdner Bank AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Krefeld'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bpifrance Investissement'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse L\\xfcnen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'WL Bank AG Westf\\xe4lische Landschaft Bodenkreditbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse G\\xf6ttingen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Kaiserslautern'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'RBS - The Royal Bank of Scotland'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Raiffeisenlandesbank Ober\\xf6sterreich AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Deloitte Banking'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Volksbank-Bruhrain-Kraich-Hardt eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ostfriesische Volksbank eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Volksbank Chemnitz eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Augsburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kreissparkasse Heilbronn'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse Kierspe-Meinerzhagen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Landesbank Baden-W\\xfcrttemberg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Grundkreditbank eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Finanzausschuss'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Goldman Sachs'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bank of America'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Braunschweigische Landessparkasse'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Sparkasse N\\xf6rdlingen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Versicherungs- und Wirtschaftsdienste GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Volksbank G\\xf6ppingen eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Reimann Investors'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Erste Bank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Ministerium  f\\xfcr Finanzen und Wirtschaft Baden-W\\xfcrttemberg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bank of China'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Parlamentarisches Finanzmarktgremium'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Allgemeine Deutsche Direktbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Postbank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'STAAKE Investment & Consulting GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Volksbank Pirna eG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesverband des Deutschen Gro\\xdf- und Au\\xdfenhandels e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'EFA Tankstellenbetriebe u Mineral\\xf6lhandel GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'LN-M\\xf6belhandels GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Baumaterialien-Handelsgesellschaft AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Rewe'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Gro\\xdfmarkt Essen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ZZF \\u2013 Zentralverband des Zoologischen Fachhandels in Deutschland'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ERRT European Retail Round Table'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Safeway Supermarkt GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Turbiner-Veszkow-Wollh\\xe4ndler GbR'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Carsten M\\xfcller Fahrzeughandel'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Lidl'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesverband des Deutschen Versandhandels e.V. (bvh)'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Norddeutscher Unternehmerverband Gro\\xdfhandel-Au\\xdfenhandel-Dienstleistung e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Tengelmann Warenhandelsgesellschaft KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Baumarkt Regnitztal GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Westf\\xe4lischer Industrieklub Dortmund e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Elektro Kirchner GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ThyssenKrupp'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'R&W Industriebeteiligungen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Hamberger Industriewerke GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Industrie + Wohnbau Groth & Graalfs GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'K+S'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Aluminium Rheinfelden GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Arbeitgeberverband der Metall- und Elektroindustrie L\\xfcdenscheid e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Industrieverband Steine und Erden Baden-W\\xfcrttemberg e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Anton H\\xe4ring e. K. Werk f\\xfcr Pr\\xe4zisionstechnik'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wirtschaftsverband Stahlverformung e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'DIBAG Industriebau AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ABB Asea Brown Boveri AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Industrie-Contact AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Lanxess Deutschland GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Trumpf Werkzeugmaschinen GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Beiersdorf'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Continental'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bayerische Motoren Werke AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'ESG Elektronik System und Logistik GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Audi AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Alusingen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Henschel Wehrtechnik GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Adam Opel AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'KIRCHHOFF Holding GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'MK Metallfolien GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Robert Bosch GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Alfred Scholpp GmbH & Co KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Shiloh Industries'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'General Motors'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Renault'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Salzgitter AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'HDI Haftpflichtverband der Deutschen Industrie VaG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Firma R & W Industriebeteiligungen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Linde'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Aalberts Industries'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'M+E Consult GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Trimet Aluminium AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Aldra Ernst Guenther Albers GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband der Keramischen Industrie e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband der S\\xe4chsischen Metall- und Elektroindustrie e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Derby Cycle Werke GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Swissmetal'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'HeidelbergCement AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Jena Optronic GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Mitsubishi'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verband der Bayerischen Metall- und Elektroindustrie e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Autania Aktiengesellschaft f\\xfcr Industriebeteiligungen'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Adidas'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Oldenburgische Industrie- und Handelskammer'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'IST Industrie Service Sachsen-Th\\xfcringen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'IKB Deutsche Industriebank'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Industrie- und Handelskammer zu Coburg'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'IABG Industrieanlagen-Betriebsgesellschaft mbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Schw\\xe4bische Werkzeugmaschinen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Airbus Group'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Verein der Bayerischen Chemischen Industrie e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Siemens'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Industrie- und Handelskammer N\\xfcrnberg f\\xfcr Mittelfranken'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Kubera Industriebau'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'DI HAG Deutsche Gie\\xdferei- und Industrie-Holding AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Fresenius'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bundesverband der H\\xf6rger\\xe4te-Industrie'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'General Electric'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Viessmann Werke GmbH & Co'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Wirtschaftsverband Industrieunternehmen Baden'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'BASF'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Schaeffler Holding GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'STEMA Metalleichtbau GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'F\\xf6rderkreis Abgasnachbehandlungstechnologien f\\xfcr Dieselmotoren e.V. (FAD)'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Arbeitgeberverband der hessischen Metallindustrie Bezirksgruppe Nordhessen e.V.'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Adolf W\\xfcrth GmbH & Co. KG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Infineon'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Rheinmetall AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Bayer AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'NILES-SIMMONS Industrieanlagen GmbH'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Henkel AG & Co. KGaA'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'S\\xfcd-Chemie AG'}}\n",
      "{u'name': {u'type': u'literal', u'value': u'Mennekes Elektrotechnik GmbH & Co KG,'}}\n"
     ]
    }
   ],
   "source": [
    "query = prefixes + \"\"\"\n",
    "SELECT ?name WHERE {\n",
    "    {\n",
    "        ?e rdf:type lobbyOntology:Corporation .\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        ?subType rdfs:subClassOf lobbyOntology:Corporation .\n",
    "        ?e rdf:type ?subType .\n",
    "    }\n",
    "    ?e foaf:name ?name\n",
    "}  \n",
    "\"\"\"\n",
    "sparql.setQuery(query)\n",
    "result = sparql.query().convert()\n",
    "\n",
    "print(\"Corporations:\")\n",
    "for row in result['results']['bindings']:\n",
    "    print row"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
